import { Injectable } from '@angular/core';
import { BehaviorSubject } from 'rxjs';

export interface Message {
  to: string;
  fromName: string;
  subject: string;
  text?: string;
  extra?: string;
  date: string;
  id: number | string;
  read: boolean;
  link?: {
    url: string;
    icon?: string;
    label?: string;
  }
}

@Injectable({
  providedIn: 'root'
})
export class DataService {
  private messageCountSub = new BehaviorSubject<number>(0);
  messageCount = this.messageCountSub.asObservable();

  updateUnreadCount() {
    this.messageCountSub.next(this.messages.reduce((count, msg) => { return count + +(!msg.read) }, 0));
  }

  messageArrived(mailObj) {
    this.messages.unshift(mailObj);
    this.updateUnreadCount();
  }

  public messages: Message[] = [

    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'താങ്കളുടെ വിവാഹം രേഖപ്പെടുത്തിയിരിക്കുന്നു',
      text: 'താങ്കളുടെ വിവാഹം അനൂപ്.ടി.ആർ (വാർഡ് മെമ്പർ ) എന്ന വ്യക്തി തന്ന രേഖകളുടെ അടിസ്ഥാനത്തിൽ താൽക്കാലികമായി രേഖപ്പെടുത്തിയിരിക്കുന്നു. താങ്കളുടെ വിവാഹ സർട്ടിഫിക്കറ്റ് സ്വഭാവനടപടിക്രമങ്ങളുടെ ഭാഗമായി 10 ദിവസത്തിനുള്ളിൽ സ്ഥിരീകരിക്കുന്നതാണ്. രേഖകൾ കണ്ട് ബോധ്യപ്പെടുന്നതിനും അഭിപ്രായം അറിയിക്കുന്നതിനും താഴെ കാണുന്ന ലിങ്ക് ഉപയോഗിക്കുക. ',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Yesterday',
      id: 1,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'തെങ്ങിൻതൈ വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Yesterday',
      id: 2,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'ആട് വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Yesterday',
      id: 3,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'കട്ടിൽ വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Yesterday',
      id: 4,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'കോഴിക്കുഞ്ഞ് വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Yesterday',
      id: 5,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'മത്സ്യകുഞ്ഞുങ്ങൾ വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Last Week',
      id: 6,
      read: true
    },
    {
      to: 'you',
      fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
      subject: 'സോളാർ പാനൽ വിതരണ പദ്ധതിയിൽ താങ്കൾ അർഹനാണ്.',
      text: 'ടി പദ്ധതിയുടെ ഗുണഭോകതാവാവാൻ താങ്കൾ അർഹനാണ്. താങ്കൾ അർഹനാനായിട്ടുള്ള എല്ലാ പദ്ധതികളുടെയും ഈ വർഷത്തെ അന്തിമപട്ടിക 26/ 12 / 2020 ന് പ്രസിദ്ധീകരിക്കുന്നതാണ്. അർഹത താങ്കൾ നിരസിക്കാത്ത പക്ഷം, ഓരോ പട്ടികയിലെയും മുൻഗണന ക്രമത്തിൽ താങ്കളുടെ വിഹിതം നൽകുന്നതാണ്. പദ്ധതിയിൽ പങ്കെടുക്കുന്ന പക്ഷം താങ്കൾക്കുള്ള ഉത്തരവാദിത്വങ്ങൾ അടക്കം പദ്ധതിയുടെ പൂർണ്ണമായ വിവരങ്ങൾക്കും താങ്കളുടെ അവസരം വേണ്ടെന്ന് വെക്കാനും താഴെയുള്ള ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
      link: { url: '/ente/gramam/Xmessage' },
      date: 'Last Week',
      id: 7,
      read: true
    }
  ];

  chats = [
    {
      discussion: 'ente/gramam/discussion/11',
      id: '25436',
      author: 'ഹരീഷ് കെ പി',
      message: 'ഇതൊരു സുസ്ഥിരവികസന മാതൃകയല്ല, ഏതാനും വർഷങ്ങൾക്കുള്ളിൽ ഇത് അപ്രായോഗികമാകും.'
    },
    {
      discussion: 'ente/gramam/discussion/11',
      id: '25437',
      author: 'ദേവദാസ് കെ എ',
      message: 'ലോകത്തിന്റെ ഒരു ഭാഗത്ത് പറക്കുന്ന കാറുകൾക്ക് അനുമതി കിട്ടുന്നു, എല്ലായിടത്തും പൊതു ഗതാഗതസംവിധാനങ്ങൾ മെച്ചപ്പെടുത്താൻ സർക്കാരുകൾ ശ്രമിക്കുന്നു. ഇതിലേക്കൊക്കെ മാറ്റങ്ങൾ വരുന്നതിന് മുമ്പ് എങ്ങനെയെങ്കിലും ഉള്ള സ്ഥലവും മാറ്റ് പ്രകൃതി വിഭവങ്ങളും വിറ്റ് കാശാക്കാനാണ് ശ്രമം!'
    },
    {
      discussion: 'ente/gramam/discussion/11',
      id: '25435',
      author: 'അജ്ഞാതൻ',
      message: 'അടിച്ച 300 ലോഡ് കരിങ്കല്ല് അവിടെ തന്നെയുണ്ടോന്ന് കുഴിച്ചു നോക്കാൻ പറ്റില്ലല്ലോ! :D'
    },
    {
      discussion: 'ente/gramam/discussion/11',
      id: '25438',
      author: 'പി ആർ രാഗിണി',
      message: 'ഇതേ തെറ്റുകൾ മറ്റുള്ളവർ ചെയ്‌താൽ സമ്മതിക്കില്ല, എങ്കിലും പാർട്ടിയാണ്, പാർട്ടിക്ക് വേണ്ടിയാണ് എങ്കിൽ എന്ത് നടന്നാലും ന്യായീകരിക്കാൻ ആളെ നിർത്തിയിട്ടുണ്ട്.'
    }
  ]

  constructor() {
    let i = 0;
    setTimeout(() => {
      this.messageArrived(
        {
          to: 'group',
          fromName: 'ബാലമല്ലു പഞ്ചായത്ത്',
          subject: 'ഒക്ടോബർ മാസത്തിലെ ഗ്രാമസഭയുടെ അവതരണ വീഡിയോ',
          text: 'ഗ്രാമസഭയുടെ അവതരണ വീഡിയോ കാണാനും തുടർന്ന് പ്രക്രിയയുടെ ഭാഗമാകാനും താഴെ കാണുന്ന ലിങ്കിൽ ക്ലിക്ക് ചെയ്യുക.',
          extra: 'ഓരോ അവതരണത്തിന് ശേഷവും രണ്ടാഴ്ച്ച ജനങ്ങൾക്ക് അഭിപ്രായങ്ങളും സംശയങ്ങളും അറിയിക്കാനുള്ള സമയമാണ്. പരമാവധി കാര്യങ്ങൾക്ക് ഇതിനിടയിൽ അതാത് ദിവസങ്ങളിൽ തന്നെ ഉദ്യോഗസ്ഥർ വിശിദീകരണം നല്കന്നതായിരിക്കും. മുഴുവൻ കാര്യങ്ങൾക്കും വീണ്ടും ഒരു അവതരണ വിഡിയോയിയിലൂടെ മറുപടി നൽകി മൂന്നാഴ്ച്ചക്ക് ശേഷം ഗ്രാമസഭയുടെ തീരുമാനങ്ങൾ പ്രസിദ്ധീകരിക്കുന്നതായിരിക്കും. തുടർന്ന് ആരും പരാതികൾ ഉന്നയിക്കാത്ത തീരുമാനങ്ങൾ നാലാമത്തെ ആഴ്ച മുതൽ നടപ്പിലാക്കാൻ പഞ്ചായത്ത് നടപടികൾ കൈക്കൊള്ളും.',
          link: { url: '/ente/gramam/meetings/2020-10-01' },
          date: 'JUST NOW',
          id: 0,
          read: false
        }
      )
      // this.messageCountSub.next(++i);
    }, 1000);
  }

  public getMessages(filter?: Object): Message[] {
    if (filter) {
      const filterArr = Object.entries(filter);
      let result = [];
      for (let [key, value] of filterArr) {
        result = this.messages.filter(x => x[key] === value);
      }
      return result;
    }
    return this.messages;
  }

  public getChats() {
    return this.chats;
  }

  public getMessageById(id: number): Message {
    const found = this.messages.findIndex(x => x.id === id);
    if (~found) {
      this.messages[found].read = true;
      this.updateUnreadCount();
      return this.messages[found];
    }
    else {
      return {
        to: 'you',
        fromName: 'ഓൺലൈൻ ഗ്രാമസഭ',
        subject: 'ഈ സന്ദേശം ഇപ്പോൾ ലഭ്യമല്ല!',
        text: 'ഈ സന്ദേശം ഇപ്പോൾ ലഭ്യമല്ല!, എഴുതിയ ആൾ ഇത് നീക്കം ചെയ്യുകയോ സഭ്യമല്ലാത്ത ഭാഷക്ക് ഇത് റിപ്പോർട്ട് ചെയ്യുകയോ നടന്നിരിക്കാം.',
        link: { url: '/ente/gramam/messages' },
        date: 'JUST NOW',
        id: 'x',
        read: false
      }
    }
  }
}
