import { Injectable } from '@angular/core';
import { BehaviorSubject, Observable } from 'rxjs';

import { Tip } from "@shared/models";
import { of } from 'rxjs';
import { tap } from 'rxjs/operators';

@Injectable({
  providedIn: 'root'
})
export class TipsService {


  // should allow skip All
  // check step, tip not shown, go to stepper, continue with url
  // mark each step as completed
  // allow multiple steps

  private tipKey: BehaviorSubject<string> = new BehaviorSubject<string>('');;
  private tipIndex: BehaviorSubject<number> = new BehaviorSubject<number>(0);
  private showTips: number[] = [];

  series: string[] = [
    "anonymous",
    "/intro",
    "/help",
    "/ente/gramam/messages",
    "/ente/gramam/meetings",
    "/ente/gramam/projects",
    "/ente/gramam/articles"
  ];


  tips: Array<Tip | Tip[]> = [
    {
      title: "ശ്രദ്ധിക്കേണ്ട കാര്യങ്ങൾ",
      desc: "നിങ്ങളാര് എന്ന് അറിയിക്കാതെ തന്നെ സ്വാതന്ത്ര്യമായി അഭിപ്രായങ്ങൾ രേഖപ്പെടുത്താം, കൂടെ ശ്രദ്ധിക്കേണ്ട കാര്യങ്ങൾ",
      list: [
        "നിങ്ങളാര് എന്ന് വ്യക്തമാക്കുന്ന സൂചനകളൊന്നും രേഖപ്പെടുത്താതിരിക്കുക",
        "ഒരിക്കൽ അഭിപ്രായം രേഖപ്പെടുത്തി നിശ്ചിതസമയം കഴിഞ്ഞാൽ അഭിപ്രായം തിരുത്തുവാൻ സാധിക്കില്ല",
        "നിങ്ങളുടെ അഭിപ്രായം നിങ്ങൾക്ക് നിയമപരമായ ഒരു ബാധ്യതയും ഉണ്ടാക്കില്ല",
        "നിങ്ങളുടെ അഭിപ്രായം മര്യാദപൂർവമല്ലെങ്കിൽ റിപ്പോർട്ട് ചെയ്യപ്പെടാൻ ഉള്ള സാധ്യതയുണ്ട്",
        "റിപ്പോർട്ട് ചെയ്യപ്പെടുന്ന പക്ഷം അത് നിങ്ങളുടെ അഭിപ്രായം രേഖപ്പെടുത്താനുള്ള അവകാശം സമയബന്ധിതമായി ഇല്ലാതാക്കുന്നതാണ്",
        "തെറ്റായി റിപ്പോർട്ട് ചെയ്തോ എന്ന് പരിശോധിക്കുന്നത് കേരളത്തിലെ ഏതെങ്കിലും മൂന്നാളുകൾ ആയിരിക്കും.",
        "തെറ്റായി റിപ്പോർട്ട് ചെയ്തു എന്ന് ബോധ്യപ്പെടുന്ന പക്ഷം റിപ്പോർട്ട് ചെയ്ത ആളിന് അഭിപ്രായം രേഖപ്പെടുത്താൻ ഉള്ള അവകാശം സമയബന്ധിതമായി ഇല്ലാതാക്കുന്നതാണ്"
      ]
    },
    [
      {
        title: "സ്വാഗതം",
        desc: "ഓരോന്നിലേക്കും കടക്കും മുമ്പ് ഇത് പോലെ സഹായകമായ വിവരണങ്ങൾ ഒന്നോ അതിലധികമോ ഉൾപ്പെടുത്തിയിട്ടുണ്ട്. "
          + "വായിക്കേണ്ടെങ്കിൽ മുകളിൽ വലത് വശത്തായി കാണുന്ന അടുത്തത് എന്നതിൽ ക്ലിക്ക് ചെയ്താൽ മതി. അടുത്ത വിവരണത്തിലേക്ക് പോകാൻ താഴെയുള്ള മുന്നിലേക്ക് എന്നതിൽ ക്ലിക്ക് ചെയ്യുക."
      },
      {
        title: "പ്രാമുഖ്യം",
        desc: "ഓൺലൈൻ ഗ്രാമസഭ ഉപയോഗിക്കാൻ അറിയാത്തവർക്കുള്ള ഏറ്റവും വലിയ നഷ്ടം അവർക്ക് അവരുടെ അഭിപ്രായങ്ങൾ അവർ ആരെന്ന് വെളിപ്പെടുത്താതെ അറിയിക്കാൻ സാധിക്കില്ല എന്നതാണ്."
          + "ഇതിന് വേണ്ടി സാങ്കേതിക വിദ്യകൾ ഉപയോഗപ്പെടുത്തി കൊണ്ടുള്ള അഭിപ്രായ ബൂത്തുകൾ ഓരോ വാർഡിലും എളുപ്പത്തിൽ സ്ഥാപിച്ചു ഉപയോഗപ്പെടുത്താവുന്നതാണ്."
      },
      {
        title: "പ്രതീക്ഷ",
        desc: "ഓൺലൈൻ ഗ്രാമസഭ നിലവിലുള്ള ഗ്രാമസഭക്ക് ഉടനെയുള്ള ഒരു ബദൽ സംവിധാനമായി കാണേണ്ടതില്ല! "
          + "എങ്കിലും നേരിട്ട് ഗ്രാമസഭകളിൽ പങ്കെടുക്കാൻ സാധിക്കാത്ത ഭൂരിപക്ഷം ജനങ്ങൾക്കും അവർക്ക് വേണ്ടുന്ന തീരുമാനങ്ങൾ എടുക്കാനും"
          + "അവർക്ക് വേണ്ടി തന്നെ സുതാര്യമായി നടപ്പിൽ വരുത്താനും ഉറപ്പ് നൽകുന്ന ഒരു സംവിധാനം എന്ന നിലയിൽ ഉടനെ തന്നെ ഇത് ഭരിക്കുന്ന സർക്കാരുകൾ നടപ്പിൽ വരുത്തും എന്ന് കരുതട്ടെ!"
      }
    ],
    {
      title: "സുതാര്യത",
      desc: "ഓൺലൈൻ ഗ്രാമസഭ മൊബൈലിലോ കമ്പ്യൂട്ടറിലോ ഉപയോഗിക്കാൻ അറിയാത്ത ആളുകൾക്കായി വാർഡ് മെമ്പറുടെ നേതൃത്വത്തിൽ അഭിപ്രായങ്ങളും ആവശ്യങ്ങളും അറിയിക്കാവുന്നതാണ്."
        + "മതപരമായോ രാഷ്ട്രീയപരമായോ വേറൊരു ആശയം കൊണ്ട് നടക്കുന്ന വാർഡ് മെമ്പർ ആണെങ്കിൽ കൂടി നിങ്ങളുടെ അഭിപ്രായം കൃത്യമായി തന്നെ രേഖപ്പെടുത്തും എന്നത് ഉറപ്പാണ്."
        + "കാരണം നിങ്ങൾ എന്ത് പറയുന്നുവെന്നും നിങ്ങളുടെ ആവശ്യം എന്തായിരുന്നുവെന്നും ഓൺലൈൻ ഗ്രാമസഭ ഉപയോഗിക്കുന്ന ഏതൊരാളുടെ സഹായത്തോടെയും നിങ്ങൾക്ക് ഉറപ്പ് വരുത്താവുന്നതാണ്."
    },
    {
      title: "സന്ദേശങ്ങൾ",
      desc: "സാധാരണ രീതിയിൽ നമ്മൾ അറിയാതെ പോകുന്നതായ എല്ലാ വിധ സന്ദേശങ്ങളും നിങ്ങൾക്ക് വേണ്ടി ഇവിടെയുണ്ടാകും."
        + " ഗ്രാമസഭ തുടങ്ങുന്നത് മുതൽ അവസാനിക്കുന്നത് വരെയുള്ള ഘട്ടങ്ങൾ, നിങ്ങൾ പറഞ്ഞ അഭിപ്രായത്തിനുള്ള മറുപടികൾ, "
        + "നിങ്ങളുടെ വാർഡിൽ നടക്കുന്ന പദ്ധതികളുടെ ദിവസേനയുള്ള അറിയിപ്പുകൾ, സർക്കാർ തലത്തിൽ നിന്നും വരുന്ന ഫണ്ട് വിവരങ്ങൾ എന്നിങ്ങനെയെല്ലാം നിങ്ങൾക്കിവിടെ ലഭ്യമാകും."
    },
    [
      {
        title: "ഗ്രാമസഭ അവതരണം",
        desc: "സ്ഥിരമായി ജോലിയുള്ളവർക്കും ജോലിക്കായി സ്ഥലത്തില്ലാത്തവരും സാധരണ കണ്ടിരിക്കാൻ ഇടയില്ലാത്ത ഒന്നാണ് "
          + "ഗ്രാമസഭയുടെ അവതരണം. ജനങ്ങൾക്ക് അവരുടെ കാര്യങ്ങൾ തീരുമാനിക്കാൻ അവസരം നൽകുന്ന ഗ്രാമസഭകൾ"
          + " മൂന്ന് മാസത്തിൽ ഒരിക്കൽ നടക്കുന്ന മൂന്ന് മണിക്കൂർ പരിപാടിയിൽ നിന്ന് എല്ലാവർക്കും പ്രയോജനപ്പെടുന്ന വിധത്തിൽ ചുരുങ്ങിയത്"
          + " മൂന്നാഴ്‌ച എങ്കിലും നീളുന്ന ഒരു ഇടപെടൽ നടക്കുന്നതായി മാറണം എന്നതാണ് പ്രധാന ഉദ്ദേശ്യം."
      },
      {
        title: "ഗ്രാമസഭ അവലോകനം",
        desc: "ഗ്രാമസഭ ഒരു തുടർപ്രക്രിയ ആണെന്നറിയാമല്ലോ! എല്ലാവർക്കും നീതി ഉറപ്പാക്കാനും അനാവശ്യഇടപെടലുകൾ നടന്നില്ലെന്ന് "
          + "ഉറപ്പ് വരുത്താനും കഴിഞ്ഞ ഗ്രാമസഭകളുടെ രേഖകൾ കൂടിയേ തീരൂ... ഓൺലൈൻ ഗ്രാമസഭ ഉപയോഗിച്ചാൽ വിട്ടു പോയ "
          + "കാര്യങ്ങളിൽ നിന്നും വീണ്ടും തുടങ്ങാനും നിങ്ങളുടെ അഭിപ്രായങ്ങൾ ഒരു ചർച്ചക്ക് വഴി തുറന്നുവെന്നും ഉറപ്പിക്കാൻ സാധിക്കും."
      }
    ],
    [
      {
        title: "പദ്ധതികൾ - ആവശ്യങ്ങൾ",
        desc: "ഞങ്ങളുടെ ആവശ്യങ്ങളാണ് പദ്ധതികളായി മാറേണ്ടത്. ഗ്രാമസഭയുടെ ഒന്നാം ഘട്ടം അവതരണത്തിന് ശേഷം ഓരോ പൗരനും "
          + "തങ്ങളുടെ ആവശ്യങ്ങൾ ഗ്രാമസഭയെ അറിയിക്കുന്നു. നേരിട്ട് ഗ്രാമസഭയിലോ ഓൺലൈൻ ഗ്രാമസഭ വഴിയോ അവതരിപ്പിക്കപ്പെട്ട ആവശ്യങ്ങൾ ഭക്ഷണം, വസ്ത്രം, പാർപ്പിടം എന്നിങ്ങനെ മുൻഗണനാ ക്രമത്തിൽ അപേക്ഷകളെ"
          + " അപേക്ഷകർ തന്നെയോ ഉദ്യോഗസ്ഥരോ തരാം തിരിക്കുന്നു. തിരഞ്ഞെടുക്കപ്പെട്ട ഭരണസമിതിയുടെ പ്രകടന പത്രികയിൽ പറഞ്ഞ പോലെ ഓരോ വിഭാഗത്തിനും നിശ്ചിത ശതമാനം തുക വകയിരുത്തുന്നു."
      },
      {
        title: "പദ്ധതികൾ - നടപ്പാക്കൽ",
        desc: "വർഗ്ഗീകരണത്തിന് ശേഷം ഏറ്റവും കൂടുതൽ ആളുകൾ ഒരു പോലെ അറിയിച്ച ഒരു ആവശ്യവും ഏറ്റവും സവിശേഷമായി മറ്റൊരാളും "
          + "ഉന്നയിക്കാതെ പട്ടികയിൽ ആദ്യം ഇടം പിടിച്ച ഒരാളുടെ ആവശ്യവും പദ്ധതികളായി മാറുന്നു. അതായത് ഓരോ പട്ടികയിൽ നിന്നും ആളുകളുടെ എണ്ണം"
          + " അനുസരിച്ച് ഏറ്റവും മുകളിൽ വന്നതും ഒരാൾ മാത്രം ആവശ്യപ്പെട്ടത് കൊണ്ട് ഏറ്റവും താഴെ വന്നതും എന്ന നിലയിലാണ് മുന്നോട്ട് പോകുക."
          + " ഇങ്ങനെ പ്രത്യേക സാഹചര്യം കൊണ്ട് ഉടലെടുത്ത ഒരാളുടെ ഒറ്റപ്പെട്ട ആവശ്യം പോലും കാലതാമസമില്ലാതെ നടപ്പിൽ വരുമെന്ന് ഉറപ്പ് വരുത്തുന്നു."
      }
    ],
    {
      title: "രേഖകൾ എങ്ങിനെ ആയിരിക്കണം?",
      desc: "രേഖകൾ വെറുതെ pdf ഫയൽ ആയോ ഗൂഗിൾ ഡോക്യുമെന്റ് ആയോ തരുന്നതിന് പകരം സെർച്ച് ചെയ്യാവുന്നതും "
        + "തരം തിരിക്കാവുന്നതുമായ രേഖകൾ ആണ് ലഭ്യമാക്കുക. ഇത് രേഖകൾ ശരിയയാണെന്ന് എളുപ്പം പൊതുജനത്തിന് വിലയിരുത്താനും"
        + " തെറ്റുകൾ ചൂണ്ടിക്കാണിക്കാനും സഹായിക്കും, കൂടാതെ വിദഗ്ദ്ധരായ ആളുകൾക്ക്  സ്വാതന്ത്ര്യമായി ഡാറ്റ ഉപയോഗിച്ച് അനലിറ്റിക്സ് നടത്താനും തീരുമാനങ്ങളിൽ എത്തി ചേരാനും സഹായിക്കും."
    }
  ]

  constructor() { }

  public hasTip(key) {
    let tipIndex = this.series.findIndex(b => b === key)
    // return ~tipIndex && tipIndex > this.tipIndex.value; // Skip once you reached so far
    return ~tipIndex && !~this.showTips.findIndex(b => b === tipIndex);
  }

  public get currentTipValue(): string {
    return this.tipKey.value;
  }

  public set newTipValue(url) {
    this.tipKey.next(url);
  }

  getTipByKey(key) {
    let i = this.series.findIndex(b => b === key);
    if (~i) {
      this.tipIndex.next(i);
      this.showTips.push(i);
    }
    return this.getTipByIndex(i);
  }

  getTipByIndex(i) {
    return of(this.tips[i]).pipe(
      tap(console.log)
    );
  }






}
